Revit 2024 API
BuiltInFailures.GeneralFailures.WarningInFamilyDismissed Property
 A warning in family "[Name]" was dismissed. Please review warning information to determine if any changes are necessary\nWarning Information:\n"[Text]"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WarningInFamilyDismissed { get; }
Visual Basic
Public Shared ReadOnly Property WarningInFamilyDismissed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WarningInFamilyDismissed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace